Tekla.Structures.Drawing.StraightDimensionSetHandler
The StraightDimensionSetHandler class contains operations for creating and modifying straight dimension sets.

Tekla.Structures.Drawing.StraightDimensionSetHandler.CreateDimensionSet(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes)
Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
View: The view to be used.
DimensionPoints: The dimension points to be used.
UpDirection: The direction from the dimension points to the dimension line.
Distance: The distance in paper millimeters taken from the first dimension point to the dimension line.
Attributes: The attributes to be used.
Returns: The created straight dimension set or null if fails.

Tekla.Structures.Drawing.StraightDimensionSetHandler.CreateDimensionSet(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Geometry3d.Vector,System.Double,System.Double,System.Double,Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes)
Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
View: The view to be used.
DimensionPoints: The dimension points to be used.
UpDirection: The direction from the dimension points to the dimension line.
Distance: The distance in paper millimeters taken from the first dimension point to the dimension line.
LeftTagLineOffset: The left tag line offset measured in paper millimeters.
RightTagLineOffset: The right tag line offset measured in paper millimeters.
Attributes: The attributes to be used.
Returns: The created straight dimension set or null if fails.

Tekla.Structures.Drawing.StraightDimensionSetHandler.CreateDimensionSet(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Geometry3d.Vector,System.Double)
Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
View: The view to be used.
DimensionPoints: The dimension points to be used.
UpDirection: The direction from the dimension points to the dimension line.
Distance: The distance in paper millimeters taken from the first dimension point to the dimension line.
Returns: The created straight dimension set or null if fails.

Tekla.Structures.Drawing.StraightDimensionSetHandler.CreateDimensionSet(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Geometry3d.Vector,System.Double,System.Double,System.Double)
Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
View: The view to be used.
DimensionPoints: The dimension points to be used.
UpDirection: The direction from the dimension points to the dimension line.
Distance: The distance in paper millimeters taken from the first dimension point to the dimension line.
LeftTagLineOffset: The left tag line offset measured in paper millimeters.
RightTagLineOffset: The right tag line offset measured in paper millimeters.
Returns: The created straight dimension set or null if fails.